; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	thermograph3 - mode
	thermograph0 - mode
	image6 - mode
	spectrograph4 - mode
	spectrograph1 - mode
	image5 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation7 - direction
	Star5 - direction
	Star3 - direction
	Star6 - direction
	Star1 - direction
	Star4 - direction
	Star2 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star6)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph4)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation7)
	(supports instrument3 image6)
	(calibration_target instrument3 Star1)
	(supports instrument4 thermograph3)
	(supports instrument4 image6)
	(supports instrument4 thermograph2)
	(supports instrument4 image5)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument5 thermograph3)
	(supports instrument5 spectrograph4)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 Star4)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star6)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument7 thermograph2)
	(supports instrument7 image6)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star1)
	(calibration_target instrument7 Star4)
	(supports instrument8 thermograph3)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star4)
	(supports instrument9 thermograph2)
	(supports instrument9 spectrograph4)
	(calibration_target instrument9 Star2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
)
(:goal (and
	(pointing satellite0 Planet12)
	(have_image Planet8 spectrograph4)
	(have_image Phenomenon9 spectrograph1)
	(have_image Phenomenon10 thermograph2)
	(have_image Phenomenon10 spectrograph4)
	(have_image Planet11 thermograph3)
	(have_image Planet11 spectrograph4)
	(have_image Planet12 image5)
	(have_image Planet12 thermograph3)
))

)

; plan
1. (turn_to satellite1 star3 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star3)
   goals met: 0 of 9
2. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   goals met: 0 of 9
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
4. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 0 of 9
5. (turn_to satellite0 planet8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet8)
   goals met: 0 of 9
6. (take_image satellite0 planet8 instrument0 spectrograph4)
   added: (have_image planet8 spectrograph4)
   goals met: 1 of 9
7. (turn_to satellite0 planet11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet11)
   goals met: 1 of 9
8. (take_image satellite0 planet11 instrument0 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 2 of 9
9. (turn_to satellite0 phenomenon9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 9
10. (take_image satellite0 phenomenon9 instrument0 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 3 of 9
11. (turn_to satellite0 phenomenon10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 9
12. (take_image satellite0 phenomenon10 instrument0 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 4 of 9
13. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 4 of 9
14. (calibrate satellite1 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 4 of 9
15. (turn_to satellite0 planet12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet12)
   goals met: 5 of 9
16. (turn_to satellite1 phenomenon10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 9
17. (take_image satellite1 phenomenon10 instrument4 thermograph2)
   added: (have_image phenomenon10 thermograph2)
   goals met: 6 of 9
18. (turn_to satellite1 planet11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet11)
   goals met: 6 of 9
19. (take_image satellite1 planet11 instrument4 thermograph3)
   added: (have_image planet11 thermograph3)
   goals met: 7 of 9
20. (turn_to satellite1 planet12 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet12)
   goals met: 7 of 9
21. (take_image satellite1 planet12 instrument4 image5)
   added: (have_image planet12 image5)
   goals met: 8 of 9
22. (take_image satellite1 planet12 instrument4 thermograph3)
   added: (have_image planet12 thermograph3)
   goals met: 9 of 9
